[
      {
        "id": "1",
        "status": "I decided to just create a second plugin for this blog as I find myself wasting a lot of precious learning time just to get this to work on multiple blogs with multiple tables. So nop. This is just the same plugin, renamed imLearningThis, with a new table on it.",
        "timestamp": "2023-09-02 07:20:29"
      },
      {
        "id": "2",
        "status": "I spent all my programming time dealing with custom exceptions errors. Overkilling it? Maybe. Learning? Absolutely!",
        "timestamp": "2023-09-04 16:06:38"
      },
      {
        "id": "3",
        "status": "Spending the past days trying to set up Alma Linux for deployment environment. Kind of stuck at phpmyadmin but got php to run and still need to test mysql. Once all of that its working I can start learning to deploy my spring boot apps. ?⚒️",
        "timestamp": "2023-09-07 18:09:51"
      },
      {
        "id": "4",
        "status": "Finally learned to open the ports for remote access to #1. Spring boot apps #2 mysql #3 Jenkins and so much more without having to use the vm desktop. ? So many possibilities! I can finally practice so much!",
        "timestamp": "2023-09-11 06:15:17"
      },
      {
        "id": "5",
        "status": "It has been a while, a long while! A new baby, maternity leave and now back on track! With ChatGPT help, I reorganized myself to become very proficient in the next year in web apps, REST APIs and Spring Framework. I created a board where I track everything I am doing. It is so efficient! I never understood lambdas, for example, until I asked ChatGPT and in one sentence it all made sense! I will try to write an article about how I went about with creating my lesson plans.",
        "timestamp": "2023-05-07 00:00:00"
      },
      {
        "id": "7",
        "status": "So much progress I have to show off ? I need to do a lot of fixing on the design, and I have some ideas for extra stuff like filters per rating and dates. But first, I think I am ready to go onto Spring Security to learn and apply on this project. ? <img src=\"https://marisabel.nl/wp-content/uploads/2022/07/ezgif-5-38ffa745e1.gif\">",
        "timestamp": "2022-07-22 00:00:00"
      },
      {
        "id": "8",
        "status": "Wow, I have been so focused on my project and other lives changes that I have not updated this. Well, I have been, since May, busy with my big project, and it is coming around beautifully! It still needs a few more months of work. I still need to learn Spring security to implement login and also need to learn deployment. But the app itself is almost done! Just a lot I would like to improve in design and functionality. Also, some bugs, but not so bad.\r\n\r\n",
        "timestamp": "2022-07-18 00:00:00"
      },
      {
        "id": "9",
        "status": "I finally updated my word app with what I learned from Hibernate! It took me a few days to get it right, a couple of rollbacks and a lot of documentation reading. All of which proved useful! Even the rollback… I had to start the whole Hibernate part from scratch, but this time I did not break whatever I broke the first time around, and got it all working right in an hour. So yes, if stuck, start over! It looks now worthy to display on my portfolio, even when I still want to implement a few things. ? Maybe I will leave it as it is and practice other concepts on the next project (A Reading Journal!)",
        "timestamp": "2022-04-04 00:00:00"
      },
      {
        "id": "10",
        "status": "Since I finished my twitter mini-project, I have been working on the word game, AGAIN. I love being able to apply whatever I learned on a scratch project. I finally got most of it right before continuing the Spring course with Hibernate. I was even so happy to get Validation to finally work, I made a blog post about it, so I would not forget. Now I will continue with the course and apply that to a new project before applying it to the word game for the score.\r\n\r\n",
        "timestamp": "2022-03-28 00:00:00"
      },
      {
        "id": "11",
        "status": "I almost did it! I say almost because I want to clean up my code on Monday. But I finally have my first project on the portfolio. I was being very ambitious. Wanting to build once massive app with all I’ve learned in over a year. But I decided to yet again, take micro steps. The first project is super simple. Where I practice basic Spring MVC configurations, learned a LOT about API’s and fought a bit with keeping it simple and focusing on the goal. I keep itching to add just once more function, but it will probably break. So I will hold on for that one when I work on the Spring Boot project. I also want to add a few simple back end ones, but for that I need to polish my ideas. Mainly around the Twitter API, which is a lot of fun!\r\n\r\n",
        "timestamp": "2022-03-12 00:00:00"
      },
      {
        "id": "12",
        "status": "I’ve been on a break through December and also ended up with surprise events in my life. So I’ve been slacking with anything digital. However, I plan on restructuring this website the way I wish to and continue my Spring learning journey. Looking forward to it!",
        "timestamp": "2022-01-20 00:00:00"
      },
      {
        "id": "13",
        "status": "The past 2 months, I’ve been very busy learning Spring. I am in LOVE. And doing this nonstop so far for the last 2 months. Probably more now with cold rainy weather coming. I think I’ve invested about 80+ hours by now on it, maybe more. I try to do 3 hours a day Mon – Thu and at least one hour per day in the weekend. Following mainly Selenium Express playlist on Spring. I am learning so much, I cannot wait to apply it to my first Spring web app! I am actually waiting after practicing, mainly because I know I have to reconfigure everything again when I get to the Spring Boot videos. Hopefully I finish that app by December.\r\n\r\n",
        "timestamp": "2021-10-06 00:00:00"
      },
      {
        "id": "14",
        "status": "I finally finished collections, and am so happy I get it now! I will write a blog post soon.\r\n\r\nAlso, just wrote about my quick twitter code, a proud moment for me.\r\n\r\nNext up this week, Network Programming, Expressions and String Manipulation! Next week is Holidays, so we will see how much I do ?",
        "timestamp": "2021-08-08 00:00:00"
      },
      {
        "id": "15",
        "status": "I’ve spent the past 3 days working on the GUI for my Lingo game. It started slow, and I was getting headaches, understanding how FMXL works. But once I had it figure out, it was hands-on fun from there. I am having a lot of fun! I even got to the point where it was freezing for some reason on the second screen when trying to load the game. Then it hit me. THREADS! OMG! Life changer! I found a great virtual class online on the concept of Threads and Concurrency, which made it more clear. Once I watched that and understood what the code does, I was able to implement it with the Runnable interface, and it works! I am not at the point of receiving the guess from TextField. Once that is done, I am sure the rest is basically set. Though, I am being very picky with the design and the fact that intelliJ doesn’t allow you CSS on the community version. So I will have to look into how to go around that. This is again, just like when I started learning, to understand how GUI works. After that, I need to review and clean the code. And after that, start planning how to do this with the simple journal before venturing into Spring for the dashboard I’ve been dreaming about.\r\n\r\n",
        "timestamp": "2021-07-02 00:00:00"
      },
      {
        "id": "16",
        "status": "I finally understand the purpose of collections and can’t wait to study a code I found and apply what I learned in my project! Also, finally understand the Liskov Substitution Principle… I think I was thinking it was more than I understood. But after many videos with different examples, it is exactly what I understood. A child class/ subtype needs to have the same requirements as the parent class. I found some good code with an example, the same one I want to study to understand Collections and how they are being used with databases for speed. Micro-Learning is really working! Though, I am not sure 1.5 hours today count as micro-learning. It is Saturday, after all. But the rest of the week I have been doing 15 minutes at a time, sometimes twice a day, just understanding one concept at a time, as well as I can.\r\n\r\nI will follow up soon on micro-learning with a blog post on the concept and how it helps me. As well as why I think studying with soft classical music is inefficient, versus what I prefer. Stay tuned!",
        "timestamp": "2021-06-26 00:00:00"
      },
      {
        "id": "17",
        "status": "This past week I went through the Java Object Oriented Programing course and I realized how much I still have to learn. But also how much my understanding is progressing. I am now taking each subject not covered in small parts. Experimenting a bit with microlearning, where I spend 30 mins on a concept and the code. If I understand it, I move on. If not, I look into more resources to try to understand it. And as a checklist fanatic, have a list of each subject I wish to cover.\r\n\r\nMy current stage is Generics and Collections. Subjects that frustrated me months ago. I found a book (though old) from O’Reilly, specifically for Generics and Collections, and it is the most understandable book on the subject I’ve found so far. (Much more helpful than Java in a Nutshell) I am taking it section by section with a max of 3 per day in order to practice and process, instead of spending hours frying my brain. It is actually working, and I am looking forward to finishing it (it is not a big book).",
        "timestamp": "2021-06-20 00:00:00"
      },
      {
        "id": "18",
        "status": "Wanted to start this page as I realize I do not write enough actual content. I have been through some transitions and blasts of artsy inspiration plus work becoming busier, leaving me a bit tired. Not to mention the random beautiful sunny days I used to go out to skate in the evenings. With this log I hope to remember where I am at.\r\n\r\nI am still busy with Udemy course, kind of stuck at threads. But decided to go through the videos in the mornings and even if I do not understand, look up more information after to compare “notes” and understand better. That being said, it got me kind of motivated to see that I am almost done with all the sections I wanted to do with that course. So I bought another one on Spring & Hibernate for web apps which I would love to be able to work on for my journal. So I am now looking forward to that and doing my best to get there! ??\r\n\r\nMood: Inspired",
        "timestamp": "2021-05-22 00:00:00"
      },
      {
        "id": "19",
        "status": "Learned to proxy the ports and after playing around, working on a blog post plus the projects to showcase and use privately.",
        "timestamp": "2023-09-15 16:15:08"
      },
      {
        "id": "20",
        "status": "I did it. I ordered my VPS and I am starting playing with it. It is set up go, and hopefully my apps will be up and running this year. Though I have a lot to learn about spring security before I deploy them, I am getting closer to understanding how to deploy them. Need to think what scripts I want and how to configure Jenkins to do it for me. First I will play with a demo blank app and take it from there. But I am happy because now I can do it all from my phone when I have no access to a computer. ?",
        "timestamp": "2023-09-18 13:48:00"
      }
]